In [2]:
from datascience import *
import numpy as np

%matplotlib inline
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')

## Words of Caution ##
- Remember to run the cell above. It's for setting up the environment so you can have access to what's needed for this lecture. For now, don't worry about what it means: we'll learn more about what's inside of it in the next few lectures.
- Data science is not just about code, so please don't go over this notebook by itself. Have the relevant textbook sections or lecture video at hand so that you can go over the discussion along with the code. Thank you!

## Python ##

In [4]:
2 + 9

11

In [5]:
2 * 9

18

In [6]:
2 / 9

0.2222222222222222

In [7]:
2 + 3 * 9

29

In [8]:
(2 + 3) * 9 # follows order of operations

45

In [9]:
2 + 3 * 9

29

In [10]:
# two to the power of four: 2 * 2 * 2 * 2
2 ** 4 # same thing as 2^4

16

In [11]:
2*2*2*2

16

In [12]:
2 * 2 * 2 * 2
# aesthetics/formating preferences

16

In [13]:
'hello'

'hello'

In [14]:
"hello"

'hello'

In [21]:
hello = 'hello message' # defined new variable hello
hello# call on hello, which displays its value below
'hello'
#print(2) # Jupyter notebooks by default displays the last thing in the cell
# UNLESS we explicitly print lines above: print(hello)

'hello'

In [22]:
"hello"

'hello'

In [27]:
my_message = "my dog's name is gary"
my_message # by default, Jupyter notebooks will display last thing in the cell that's called
print(my_message) # forces a display of a value


# write as many comments for yourself, for your understanding in these cells

my dog's name is gary

In [29]:
# try things out 
print(abc)
# ask someone about this later....

NameError: name 'abc' is not defined

## Names ##

In [30]:
a = 4 # assigning value of 4 to variable name, a

In [32]:
a # calling on variable name, a
# what is printed below is the value assigned to the name, a

4

In [33]:
b = 9

In [34]:
b

9

In [35]:
a * 3  # same thing as 4 * 3

12

In [36]:
total = a + b # same thing as 4 + 9
# a + b = 4 + 9 = 13
# assiging value to variable name, total
# nothing gets printed/displayed on the screen
# which is correct behavior in Jupyter notebooks in a variable assignment

In [37]:
total # if we want to see what is in total
# we need to call on it

13

In [38]:
a = 10 # before a = 4, now it is equal to 10

In [39]:
total # takes a snapshot of the value given previously

13

In [40]:
total = a + b # 10 + 9

In [41]:
total # variable name total = 19

19

In [43]:
'total' # is different from the string 'total'

'total'

### Why Names?

In [44]:
hours_per_week = 38
weeks_per_year = 52

In [46]:
hours_per_year = hours_per_week * weeks_per_year # 38 * 52
# assigning value to hours_per_year
# no display/print, correct behavior

In [47]:
hours_per_year # calling on the variable name

1976

In [53]:
# Minimum wage for businesses w/26 or more employees
# Goes up by $1/hr until 2022
ca_hourly_minimum_wage = 16.00

In [54]:
weekly_wages = hours_per_week * ca_hourly_minimum_wage # 38 * 15.50, assigning value
weekly_wages # calling on variable name

608.0

In [55]:
yearly_wages = hours_per_year * ca_hourly_minimum_wage
yearly_wages

31616.0

In [51]:
38 * 15.50

589.0

In [52]:
38 * 52 * 15.50

30628.0

## Functions and Call Expressions

In [58]:
abs(-5)

5

In [59]:
abs(1 - 3) # or abs(-2)

2

In [60]:
day_temp = 52
night_temp = 47
abs(night_temp - day_temp) # abs(47 - 52) = abs(-5)

5

In [57]:
min(14, 15)

14

In [56]:
max(14, 15)

15

In [61]:
help(max)

Help on built-in function max in module builtins:

max(...)
    max(iterable, *[, default=obj, key=func]) -> value
    max(arg1, arg2, *args, *[, key=func]) -> value

    With a single iterable argument, return its biggest item. The
    default keyword-only argument specifies an object to return if
    the provided iterable is empty.
    With two or more arguments, return the largest argument.

In [62]:
round(123.456)

123

In [63]:
round(123.456, 0)

123.0

In [64]:
round(123.456, 1)

123.5

In [65]:
round(123.456, ndigits = 1)
# round to tenth decimal place

123.5

In [66]:
help(round) # help documentation on any of the function i want to call on in this notebook

Help on built-in function round in module builtins:

round(number, ndigits=None)
    Round a number to a given precision in decimal digits.

    The return value is an integer if ndigits is omitted or None.  Otherwise
    the return value has the same type as the number.  ndigits may be negative.

## Tables ##

In [71]:
help(Table.read_table)

Help on method read_table in module datascience.tables:

read_table(filepath_or_buffer, *args, **vargs) method of abc.ABCMeta instance
    Read a table from a file or web address.

    Args:
        filepath_or_buffer -- string or file handle / StringIO; The string
                          could be a URL. Valid URL schemes include http,
                          ftp, s3, and file.

    Returns:
        a table read from argument

    Example:

    >>> Table.read_table('https://www.inferentialthinking.com/data/sat2014.csv')
    State        | Participation Rate | Critical Reading | Math | Writing | Combined
    North Dakota | 2.3                | 612              | 620  | 584     | 1816
    Illinois     | 4.6                | 599              | 616  | 587     | 1802
    Iowa         | 3.1                | 605              | 611  | 578     | 1794
    South Dakota | 2.9                | 604              | 609  | 579     | 1792
    Minnesota    | 5.9                | 598              | 610  | 578     | 1786
    Michigan     | 3.8                | 593              | 610  | 581     | 1784
    Wisconsin    | 3.9                | 596              | 608  | 578     | 1782
    Missouri     | 4.2                | 595              | 597  | 579     | 1771
    Wyoming      | 3.3                | 590              | 599  | 573     | 1762
    Kansas       | 5.3                | 591              | 596  | 566     | 1753
    ... (41 rows omitted)

In [72]:
cones = Table.read_table('data/cones.csv')
cones

Flavor     | Color       | Price
strawberry | pink        | 3.55
chocolate  | light brown | 4.75
chocolate  | dark brown  | 5.25
strawberry | pink        | 5.25
chocolate  | dark brown  | 5.25
bubblegum  | pink        | 4.75

In [67]:
cones.show(3)

In [68]:
cones.show()

In [69]:
cones.select('Flavor')

Flavor
strawberry
chocolate
chocolate
strawberry
chocolate
bubblegum

In [73]:
cones.select('Flavor', 'Price')

Flavor     | Price
strawberry | 3.55
chocolate  | 4.75
chocolate  | 5.25
strawberry | 5.25
chocolate  | 5.25
bubblegum  | 4.75

In [74]:
cones.drop('Price')

Flavor     | Color
strawberry | pink
chocolate  | light brown
chocolate  | dark brown
strawberry | pink
chocolate  | dark brown
bubblegum  | pink

In [75]:
cones

Flavor     | Color       | Price
strawberry | pink        | 3.55
chocolate  | light brown | 4.75
chocolate  | dark brown  | 5.25
strawberry | pink        | 5.25
chocolate  | dark brown  | 5.25
bubblegum  | pink        | 4.75

In [76]:
cones_without_price = cones.drop('Price') # assign value to a new table name
cones_without_price # call on table

Flavor     | Color
strawberry | pink
chocolate  | light brown
chocolate  | dark brown
strawberry | pink
chocolate  | dark brown
bubblegum  | pink

In [78]:
cones

Flavor     | Color       | Price
strawberry | pink        | 3.55
chocolate  | light brown | 4.75
chocolate  | dark brown  | 5.25
strawberry | pink        | 5.25
chocolate  | dark brown  | 5.25
bubblegum  | pink        | 4.75

In [80]:
cones.where('Flavor', 'Chocolate')

Flavor | Color | Price

In [81]:
cones.where('Flavor', 'chocolate')

Flavor    | Color       | Price
chocolate | light brown | 4.75
chocolate | dark brown  | 5.25
chocolate | dark brown  | 5.25

In [83]:
cones.sort('Price') # ascending, smallest to greatest

Flavor     | Color       | Price
strawberry | pink        | 3.55
chocolate  | light brown | 4.75
bubblegum  | pink        | 4.75
chocolate  | dark brown  | 5.25
strawberry | pink        | 5.25
chocolate  | dark brown  | 5.25

In [84]:
cones.sort('Price', descending=True) # greatest to smallest

Flavor     | Color       | Price
chocolate  | dark brown  | 5.25
strawberry | pink        | 5.25
chocolate  | dark brown  | 5.25
chocolate  | light brown | 4.75
bubblegum  | pink        | 4.75
strawberry | pink        | 3.55

In [85]:
cones.sort('Flavor', descending=False) # smallest to greatest,

Flavor     | Color       | Price
bubblegum  | pink        | 4.75
chocolate  | light brown | 4.75
chocolate  | dark brown  | 5.25
chocolate  | dark brown  | 5.25
strawberry | pink        | 3.55
strawberry | pink        | 5.25

In [86]:
1 < 2

True

In [87]:
'a' < 'b'

True

### A more interesting table

In [89]:
skyscrapers = Table.read_table('data/skyscrapers.csv')
skyscrapers

name                              | material  | city          | height | completed
One World Trade Center            | composite | New York City | 541.3  | 2014
Willis Tower                      | steel     | Chicago       | 442.14 | 1974
432 Park Avenue                   | concrete  | New York City | 425.5  | 2015
Trump International Hotel & Tower | concrete  | Chicago       | 423.22 | 2009
Empire State Building             | steel     | New York City | 381    | 1931
Bank of America Tower             | composite | New York City | 365.8  | 2009
Stratosphere Tower                | concrete  | Las Vegas     | 350.22 | 1996
Aon Center                        | steel     | Chicago       | 346.26 | 1973
John Hancock Center               | steel     | Chicago       | 343.69 | 1969
WITI TV Tower                     | steel     | Shorewood     | 329    | 1962
... (190 rows omitted)

In [94]:
skyscrapers.where('city', 'Los Angeles')
skyscrapers

name                              | material  | city          | height | completed
One World Trade Center            | composite | New York City | 541.3  | 2014
Willis Tower                      | steel     | Chicago       | 442.14 | 1974
432 Park Avenue                   | concrete  | New York City | 425.5  | 2015
Trump International Hotel & Tower | concrete  | Chicago       | 423.22 | 2009
Empire State Building             | steel     | New York City | 381    | 1931
Bank of America Tower             | composite | New York City | 365.8  | 2009
Stratosphere Tower                | concrete  | Las Vegas     | 350.22 | 1996
Aon Center                        | steel     | Chicago       | 346.26 | 1973
John Hancock Center               | steel     | Chicago       | 343.69 | 1969
WITI TV Tower                     | steel     | Shorewood     | 329    | 1962
... (190 rows omitted)

In [95]:
skyscrapers.where('name', 'Empire State Building')

name                  | material | city          | height | completed
Empire State Building | steel    | New York City | 381    | 1931

In [96]:
skyscrapers.where('city', 'New York City').sort('completed')
# below is a table of NYC skyscrapers, oldest to newest

name                    | material | city          | height | completed
Metropolitan Life Tower | steel    | New York City | 213.36 | 1909
Woolworth Building      | steel    | New York City | 241.4  | 1913
Chanin Building         | steel    | New York City | 197.8  | 1929
Mercantile Building     | steel    | New York City | 192.6  | 1929
Chrysler Building       | steel    | New York City | 318.9  | 1930
The Trump Building      | steel    | New York City | 282.55 | 1930
One Grand Central Place | steel    | New York City | 205.13 | 1930
Empire State Building   | steel    | New York City | 381    | 1931
Twenty Exchange         | steel    | New York City | 225.86 | 1931
500 Fifth Avenue        | steel    | New York City | 212.45 | 1931
... (63 rows omitted)

In [98]:
skyscrapers.where('city', 'New York City').sort('completed', descending=True)
# below is a table of NYC skyscrapers, newest to oldest

name                                             | material       | city          | height | completed
432 Park Avenue                                  | concrete       | New York City | 425.5  | 2015
Sky                                              | concrete       | New York City | 206    | 2015
One World Trade Center                           | composite      | New York City | 541.3  | 2014
One57                                            | steel/concrete | New York City | 306.07 | 2014
4 World Trade Center                             | composite      | New York City | 297.73 | 2014
Courtyard & Residence Inn Manhattan/Central Park | concrete       | New York City | 229.62 | 2013
Eight Spruce Street                              | concrete       | New York City | 265.18 | 2011
1 MiMA Tower                                     | concrete       | New York City | 194.55 | 2011
Goldman Sachs Headquarters                       | steel          | New York City | 228.3  | 2010
Langham Place                                    | concrete       | New York City | 192.58 | 2010
... (63 rows omitted)

In [ ]:
# can you find all skyscrapers in New Orleans and sort by material?

In [ ]:
# can you reverse the sorting above?

In [102]:
# bonus: how many steel skyscrapers can you find in this table?
skyscrapers.where('material', 'steel')
#94 steel skyscrapers

name                  | material | city          | height | completed
Willis Tower          | steel    | Chicago       | 442.14 | 1974
Empire State Building | steel    | New York City | 381    | 1931
Aon Center            | steel    | Chicago       | 346.26 | 1973
John Hancock Center   | steel    | Chicago       | 343.69 | 1969
WITI TV Tower         | steel    | Shorewood     | 329    | 1962
Chrysler Building     | steel    | New York City | 318.9  | 1930
New York Times Tower  | steel    | New York City | 318.77 | 2007
U.S. Bank Tower       | steel    | Los Angeles   | 310.29 | 1990
Wells Fargo Plaza     | steel    | Houston       | 302.37 | 1983
70 Pine               | steel    | New York City | 290.17 | 1932
... (84 rows omitted)

In [112]:
# bonus bonus: how many skyscrapers were completed in 2000?
skyscrapers.where('completed', are.between_or_equal_to(2010, 2015))

name                                             | material       | city          | height | completed
One World Trade Center                           | composite      | New York City | 541.3  | 2014
432 Park Avenue                                  | concrete       | New York City | 425.5  | 2015
One57                                            | steel/concrete | New York City | 306.07 | 2014
4 World Trade Center                             | composite      | New York City | 297.73 | 2014
Eight Spruce Street                              | concrete       | New York City | 265.18 | 2011
Devon Energy Center                              | concrete       | Oklahoma City | 257.23 | 2012
The Legacy at Millennium Park                    | concrete       | Chicago       | 249.33 | 2010
Duke Energy Center                               | concrete/steel | Charlotte     | 239.7  | 2010
Courtyard & Residence Inn Manhattan/Central Park | concrete       | New York City | 229.62 | 2013
Goldman Sachs Headquarters                       | steel          | New York City | 228.3  | 2010
... (13 rows omitted)